#+title: Machine Learning: algorithms, Code Lecture 4
#+subtitle: Recursion and Decision Trees
#+author: Nicky van Foreest
#+date: \today


#+STARTUP: overview
#+OPTIONS:  toc:1 H:3

#+PROPERTY: header-args    :session

# +include: preamble_presentation.org
#+include: preamble_handout.org


** Simplest recursion: Stationary distribution for the M/M/1 queue   :noexport:

At a queueing system, jobs arrive at a single-server station as a Poisson process with rate $\lambda$; service times are exponentially distributed with mean $1/\mu$. Then, the stationary distribution satisfies the recursion
\begin{equation}
\label{eq:2}
\pi(i) = \pi(i-1) \lambda / \mu.
\end{equation}
Suppose at most $K$ jobs fit into the system. Then we can use this code to computate $\pi$.

#+begin_src python :results output :exports both
import numpy as np


labda, mu, K = 3, 4, 5

pi = np.ones(K + 1)

for k in range(1, K + 1):
    pi[k] = pi[k - 1] * labda / mu

pi /= pi.sum()
print(pi)
#+end_src

#+RESULTS:
: [0.3041283  0.22809623 0.17107217 0.12830413 0.0962281  0.07217107]
** Fibonacci sequence

Rabbit pairs increase per generation, supposedly, according to Fibonacci's rule:
\begin{equation}
F(n) = F(n-1) + F(n-2),\quad F(0) = F(1) = 1.
\end{equation}

When using recursion, /always/ think about the stopping condition. If you mis a corner case, your code will keep running. Often it will claim more and more memory, and your computer will crash.  Stopping conditions should be /complete/: the  code below will crash if you call ~F(0.5)~ (why?), or ~F(-1)~. (In good code you should check the input.)



#+begin_src python :results output :exports both
def F(n):
    global called
    called += 1
    if n == 0 or n == 1:
        return 1
    return F(n - 1) + F(n - 2)


for n in range(20):
    called = 0
    F(n)
    print(n, called)
#+end_src

#+RESULTS:
#+begin_example
0 1
1 1
2 3
3 5
4 9
5 15
6 25
7 41
8 67
9 109
10 177
11 287
12 465
13 753
14 1219
15 1973
16 3193
17 5167
18 8361
19 13529
#+end_example

The number of times we call $F(n)$ in the course of the recursion increases very rapidly. Why is that?


*** What is the probability that Peter wins?

Let $u_{t, i}$ denote the probability that Peter wins if he has $i$ dollars. Clearly, $u_{t, i}$ satisfies the recursion:
\begin{align}
u_{t, i} &= p u_{t-1, i+1}  + q u_{t-1, i-1}, \\
u_{t, n} &= 1, \quad t\geq 0, \\
u_{t, 0} &= 0, \quad t\geq 0, \\
u_{0, i} &= 0, \quad 0\leq i < n.
\end{align}


#+begin_src python :results output :exports both
from functools import lru_cache

p = 26/50
q = 1 - p
n = 10


@lru_cache()
def u(t, i):
    if i == n:
        return 1
    if i == 0:
        return 0
    if t == 0:
        return 0
    return p * u(t - 1, i + 1) + q * u(t - 1, i - 1)


print(u(100, 5))
#+end_src

#+RESULTS:
: 0.5939863359639174

Using  recursion and memoization keeps the code short and very clean. (At least, I find real neat.)

A small detour: for the mathematically interested. In the following problem we remove the dependence on $t$.
\begin{align}
u(i) &= p u( i+1)  + q u_{i-1},\\
u(n) &= 1, \\
u(0) &= 0.
\end{align}

Suddently we end up with a /two-point boundary value problem/.
For this specific example it's simple to find an analytic solution, but in general two-point boundary value probles are numerically much harder to solve than differential equations with only initial conditions.

